IDEA Open Model
ConcreteSLSCheckResultStressLimitationEc2.TypeCheck Property
Compatible with IDEA StatiCa 20.1
 type of SLS limit stress check
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public TypeSLSLimitStressCheck TypeCheck { get; set; }
Public Property TypeCheck As TypeSLSLimitStressCheck
	Get
	Set
Property Value
Type: TypeSLSLimitStressCheck
See Also
Reference
ConcreteSLSCheckResultStressLimitationEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace